marekvi95/smartlock-fw/board/pin_mux.c
    gpio_pin_config_t NFC_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 35)  */
    GPIO_PinInit(BOARD_INITPINS_NFC_INT_GPIO, BOARD_INITPINS_NFC_INT_PIN, &NFC_INT_config);

    gpio_pin_config_t IN2B_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB2 (pin 37)  */
    GPIO_PinInit(BOARD_INITPINS_IN2B_GPIO, BOARD_INITPINS_IN2B_PIN, &IN2B_config);

    gpio_pin_config_t BATT_C_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC3 (pin 46)  */
    GPIO_PinInit(BOARD_INITPINS_BATT_C_GPIO, BOARD_INITPINS_BATT_C_PIN, &BATT_C_config);

    gpio_pin_config_t POWER_STAT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC4 (pin 53)  */
    GPIO_PinInit(BOARD_INITPINS_POWER_STAT_GPIO, BOARD_INITPINS_POWER_STAT_PIN, &POWER_STAT_config);

    gpio_pin_config_t DP_DC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC20 (pin 49)  */
    GPIO_PinInit(BOARD_INITPINS_DP_DC_GPIO, BOARD_INITPINS_DP_DC_PIN, &DP_DC_config);

    gpio_pin_config_t DP_BUSY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC21 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_DP_BUSY_GPIO, BOARD_INITPINS_DP_BUSY_PIN, &DP_BUSY_config);

    gpio_pin_config_t DP_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC22 (pin 51)  */
    GPIO_PinInit(BOARD_INITPINS_DP_RST_GPIO, BOARD_INITPINS_DP_RST_PIN, &DP_RST_config);

    gpio_pin_config_t SIGFOX_AK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC23 (pin 52)  */
    GPIO_PinInit(BOARD_INITPINS_SIGFOX_AK_GPIO, BOARD_INITPINS_SIGFOX_AK_PIN, &SIGFOX_AK_config);

    gpio_pin_config_t NFC_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE0 (pin 1)  */
    GPIO_PinInit(BOARD_INITPINS_NFC_RST_GPIO, BOARD_INITPINS_NFC_RST_PIN, &NFC_RST_config);

    gpio_pin_config_t SIGFOX_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE1 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_SIGFOX_RST_GPIO, BOARD_INITPINS_SIGFOX_RST_PIN, &SIGFOX_RST_config);

    gpio_pin_config_t IN1A_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE31 (pin 19)  */
    GPIO_PinInit(BOARD_INITPINS_IN1A_GPIO, BOARD_INITPINS_IN1A_PIN, &IN1A_config);

    /* PORTA0 (pin 22) is configured as SWD_CLK */
    PORT_SetPinMux(PORTA, 0U, kPORT_MuxAlt7);

    /* PORTA12 (pin 28) is configured as PTA12 */
    PORT_SetPinMux(BOARD_INITPINS_IN1B_PORT, BOARD_INITPINS_IN1B_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 29) is configured as PTA13 */
    PORT_SetPinMux(BOARD_INITPINS_IN2A_PORT, BOARD_INITPINS_IN2A_PIN, kPORT_MuxAsGpio);

    /* PORTA18 (pin 32) is configured as PTA18 */
    PORT_SetPinMux(BOARD_INITPINS_PSAVE_PORT, BOARD_INITPINS_PSAVE_PIN, kPORT_MuxAsGpio);

    /* PORTA20 (pin 34) is configured as RESET_b */
    PORT_SetPinMux(PORTA, 20U, kPORT_MuxAlt7);

    /* PORTA3 (pin 25) is configured as SWD_DIO */
    PORT_SetPinMux(PORTA, 3U, kPORT_MuxAlt7);

    /* PORTB0 (pin 35) is configured as LLWU_P5, PTB0 */
    PORT_SetPinMux(BOARD_INITPINS_NFC_INT_PORT, BOARD_INITPINS_NFC_INT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB0 (pin 35): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_NFC_INT_PORT, BOARD_INITPINS_NFC_INT_PIN, kPORT_InterruptRisingEdge);

    PORTB->PCR[0] = ((PORTB->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTB2 (pin 37) is configured as PTB2 */
    PORT_SetPinMux(BOARD_INITPINS_IN2B_PORT, BOARD_INITPINS_IN2B_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 44) is configured as I2C1_SCL */
    PORT_SetPinMux(PORTC, 1U, kPORT_MuxAlt2);

    /* PORTC2 (pin 45) is configured as I2C1_SDA */
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt2);

    /* PORTC20 (pin 49) is configured as PTC20 */
    PORT_SetPinMux(BOARD_INITPINS_DP_DC_PORT, BOARD_INITPINS_DP_DC_PIN, kPORT_MuxAsGpio);

    /* PORTC21 (pin 50) is configured as PTC21 */
    PORT_SetPinMux(BOARD_INITPINS_DP_BUSY_PORT, BOARD_INITPINS_DP_BUSY_PIN, kPORT_MuxAsGpio);

    /* PORTC22 (pin 51) is configured as PTC22 */
    PORT_SetPinMux(BOARD_INITPINS_DP_RST_PORT, BOARD_INITPINS_DP_RST_PIN, kPORT_MuxAsGpio);

    /* PORTC23 (pin 52) is configured as PTC23 */
    PORT_SetPinMux(BOARD_INITPINS_SIGFOX_AK_PORT, BOARD_INITPINS_SIGFOX_AK_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[23] = ((PORTC->PCR[23] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                      | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTC3 (pin 46) is configured as LLWU_P7, PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_BATT_C_PORT, BOARD_INITPINS_BATT_C_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[3] = ((PORTC->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

    /* PORTC4 (pin 53) is configured as LLWU_P8, PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_POWER_STAT_PORT, BOARD_INITPINS_POWER_STAT_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[4] = ((PORTC->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Enable: Internal pullup or pulldown resistor is enabled on the corresponding pin. */
                     | (uint32_t)(PORT_PCR_PE_MASK));

