marekvi95/smartlock-fw/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DisablePins
 * Description   : Disable output pins before going to sleep mode
 *
 * END ****************************************************************************************************************/
void BOARD_DisablePins(void)
{

    gpio_pin_config_t NFC_INT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 35)  */
    GPIO_PinInit(BOARD_DISABLEPINS_NFC_INT_GPIO, BOARD_DISABLEPINS_NFC_INT_PIN, &NFC_INT_config);

    /* PORTA0 (pin 22) is configured as SWD_CLK */
    PORT_SetPinMux(PORTA, 0U, kPORT_MuxAlt7);

    /* PORTA12 (pin 28) is disabled */
    PORT_SetPinMux(PORTA, 12U, kPORT_PinDisabledOrAnalog);

    /* PORTA13 (pin 29) is disabled */
    PORT_SetPinMux(PORTA, 13U, kPORT_PinDisabledOrAnalog);

    /* PORTA20 (pin 34) is configured as RESET_b */
    PORT_SetPinMux(PORTA, 20U, kPORT_MuxAlt7);

    /* PORTA3 (pin 25) is configured as SWD_DIO */
    PORT_SetPinMux(PORTA, 3U, kPORT_MuxAlt7);

    /* PORTB0 (pin 35) is configured as LLWU_P5, PTB0 */
    PORT_SetPinMux(BOARD_DISABLEPINS_NFC_INT_PORT, BOARD_DISABLEPINS_NFC_INT_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTB0 (pin 35): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_DISABLEPINS_NFC_INT_PORT, BOARD_DISABLEPINS_NFC_INT_PIN, kPORT_InterruptRisingEdge);

    /* PORTB2 (pin 37) is configured as ADC0_SE12 */
    PORT_SetPinMux(PORTB, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTC1 (pin 44) is configured as ADC0_SE15 */
    PORT_SetPinMux(PORTC, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTC2 (pin 45) is configured as ADC0_SE11 */
    PORT_SetPinMux(PORTC, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTC20 (pin 49) is configured as LCD_P4 */
    PORT_SetPinMux(BOARD_DISABLEPINS_DP_DC_PORT, BOARD_DISABLEPINS_DP_DC_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC21 (pin 50) is configured as LCD_P5 */
    PORT_SetPinMux(PORTC, 21U, kPORT_PinDisabledOrAnalog);

    /* PORTC22 (pin 51) is configured as LCD_P6 */
    PORT_SetPinMux(PORTC, 22U, kPORT_PinDisabledOrAnalog);

    /* PORTC23 (pin 52) is configured as LCD_P39 */
    PORT_SetPinMux(PORTC, 23U, kPORT_PinDisabledOrAnalog);

    /* PORTC3 (pin 46) is configured as LLWU_P7, PTC3 */
    PORT_SetPinMux(BOARD_DISABLEPINS_BATT_C_PORT, BOARD_DISABLEPINS_BATT_C_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 53) is configured as LLWU_P8, PTC4 */
    PORT_SetPinMux(BOARD_DISABLEPINS_POWER_STAT_PORT, BOARD_DISABLEPINS_POWER_STAT_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 54) is configured as LLWU_P9 */
    PORT_SetPinMux(BOARD_DISABLEPINS_INT1_ACCEL_PORT, BOARD_DISABLEPINS_INT1_ACCEL_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 55) is configured as LLWU_P10 */
    PORT_SetPinMux(BOARD_DISABLEPINS_BUTTON_2_PORT, BOARD_DISABLEPINS_BUTTON_2_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 57) is configured as LCD_P40 */
    PORT_SetPinMux(PORTD, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTD1 (pin 58) is configured as ADC0_SE5b */
    PORT_SetPinMux(PORTD, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTD2 (pin 59) is configured as LCD_P42 */
    PORT_SetPinMux(PORTD, 2U, kPORT_PinDisabledOrAnalog);

    /* PORTD3 (pin 60) is configured as LCD_P43 */
    PORT_SetPinMux(PORTD, 3U, kPORT_PinDisabledOrAnalog);

    /* PORTD4 (pin 61) is configured as LCD_P44 */
    PORT_SetPinMux(PORTD, 4U, kPORT_PinDisabledOrAnalog);

    /* PORTD5 (pin 62) is configured as ADC0_SE6b */
    PORT_SetPinMux(PORTD, 5U, kPORT_PinDisabledOrAnalog);

    /* PORTD6 (pin 63) is configured as ADC0_SE7b */
    PORT_SetPinMux(PORTD, 6U, kPORT_PinDisabledOrAnalog);

    /* PORTD7 (pin 64) is configured as LCD_P47 */
    PORT_SetPinMux(PORTD, 7U, kPORT_PinDisabledOrAnalog);

    /* PORTE0 (pin 1) is configured as LCD_P48 */
    PORT_SetPinMux(PORTE, 0U, kPORT_PinDisabledOrAnalog);

    /* PORTE1 (pin 2) is configured as LCD_P49 */
    PORT_SetPinMux(PORTE, 1U, kPORT_PinDisabledOrAnalog);

    /* PORTE24 (pin 20) is disabled */
    PORT_SetPinMux(PORTE, 24U, kPORT_PinDisabledOrAnalog);

    /* PORTE25 (pin 21) is disabled */
    PORT_SetPinMux(BOARD_DISABLEPINS_I2C0_SDA_PORT, BOARD_DISABLEPINS_I2C0_SDA_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE31 (pin 19) is disabled */
    PORT_SetPinMux(PORTE, 31U, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
